
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7640316765)



<pre><code>Error: Error creating Repository: googleapi: Error 403: Permission denied on &#39;locations/asia-northeast&#39; (or it may not exist).

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:
  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  &#43; resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A      &#43; create_time      = (known after apply)%0A      &#43; effective_labels = (known after apply)%0A      &#43; format           = &#34;DOCKER&#34;%0A      &#43; id               = (known after apply)%0A      &#43; location         = (known after apply)%0A      &#43; mode             = &#34;STANDARD_REPOSITORY&#34;%0A      &#43; name             = (known after apply)%0A      &#43; project          = &#34;gig-japan-398904&#34;%0A      &#43; repository_id    = &#34;ikigai.app&#34;%0A      &#43; terraform_labels = (known after apply)%0A      &#43; update_time      = (known after apply)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = true%0A        }%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      - etag    = &#34;BwYPsFb2l5Q=&#34; -&gt; null%0A      - id      = &#34;gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - project = &#34;gig-japan-398904&#34; -&gt; null%0A      - role    = &#34;roles/artifactregistry.admin&#34; -&gt; null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      - etag    = &#34;BwYPsFb2l5Q=&#34; -&gt; null%0A      - id      = &#34;gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - project = &#34;gig-japan-398904&#34; -&gt; null%0A      - role    = &#34;roles/editor&#34; -&gt; null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      - etag    = &#34;BwYPsFb2l5Q=&#34; -&gt; null%0A      - id      = &#34;gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - project = &#34;gig-japan-398904&#34; -&gt; null%0A      - role    = &#34;roles/secretmanager.admin&#34; -&gt; null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.admin&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-roles&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/artifactregistry.admin&#34;%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-roles&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/editor&#34;%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-roles&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/secretmanager.admin&#34;%0A    }%0A%0APlan: 4 to add, 0 to change, 3 to destroy.%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]: Destroying... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]: Destroying... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Creating...%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Creating...%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.admin&#34;]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Creation complete after 8s [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.admin&#34;]: Creation complete after 8s [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Creation complete after 8s [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0A
::debug::stderr: %0AError: Error creating Repository: googleapi: Error 403: Permission denied on &#39;locations/asia-northeast&#39; (or it may not exist).%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:%0A  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/d4b1c1b6-c50f-4e03-98f5-585c51bcdf3f/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = (known after apply)
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai.app"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/artifactregistry.admin" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/editor" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/secretmanager.admin" -> null
    }

  # google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/artifactregistry.admin"
    }

  # google_project_iam_member.gitops-sa-roles["roles/editor"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/editor"
    }

  # google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.admin"
    }

Plan: 4 to add, 0 to change, 3 to destroy.
google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Destroying... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Destroying... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Creating...
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Creating...
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Creating...
google_artifact_registry_repository.artifact-repository: Creating...
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Creation complete after 8s [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Destruction complete after 8s
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Creation complete after 8s [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Destruction complete after 8s
google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Destruction complete after 8s
google_project_iam_member.gitops-sa-roles["roles/editor"]: Creation complete after 8s [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]

Error: Error creating Repository: googleapi: Error 403: Permission denied on 'locations/asia-northeast' (or it may not exist).

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":
  13: resource "google_artifact_registry_repository" "artifact-repository" {

::debug::Terraform exited with code 1.
::debug::stdout: google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  + resource "google_artifact_registry_repository" "artifact-repository" {%0A      + create_time      = (known after apply)%0A      + effective_labels = (known after apply)%0A      + format           = "DOCKER"%0A      + id               = (known after apply)%0A      + location         = (known after apply)%0A      + mode             = "STANDARD_REPOSITORY"%0A      + name             = (known after apply)%0A      + project          = "gig-japan-398904"%0A      + repository_id    = "ikigai.app"%0A      + terraform_labels = (known after apply)%0A      + update_time      = (known after apply)%0A%0A      + docker_config {%0A          + immutable_tags = true%0A        }%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      - etag    = "BwYPsFb2l5Q=" -> null%0A      - id      = "gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - project = "gig-japan-398904" -> null%0A      - role    = "roles/artifactregistry.admin" -> null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      - etag    = "BwYPsFb2l5Q=" -> null%0A      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - project = "gig-japan-398904" -> null%0A      - role    = "roles/editor" -> null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be destroyed%0A  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)%0A  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      - etag    = "BwYPsFb2l5Q=" -> null%0A      - id      = "gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - project = "gig-japan-398904" -> null%0A      - role    = "roles/secretmanager.admin" -> null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/artifactregistry.admin"%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles["roles/editor"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/editor"%0A    }%0A%0A  # google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/secretmanager.admin"%0A    }%0A%0APlan: 4 to add, 0 to change, 3 to destroy.%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Destroying... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Destroying... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Creating...%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Creating...%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Creation complete after 8s [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Creation complete after 8s [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Destruction complete after 8s%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Creation complete after 8s [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0A
::debug::stderr: %0AError: Error creating Repository: googleapi: Error 403: Permission denied on 'locations/asia-northeast' (or it may not exist).%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":%0A  13: resource "google_artifact_registry_repository" "artifact-repository" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":12,"Program":"tfcmt","SHA1":"d47778b0acc1e98ffdef344c2221212303ad4884","Vars":{},"WorkflowName":"iaac_apply"} -->